messages = {
    "start": "Привіт! Я бот для парсингу {}",
    "add_product_first_step": "Введи посилання на товар iз сайту {}",
    "add_product_second_step": "➕ Тепер я слiдкую за товаром:\n{}\n\n- Назва: {}\n- Оптова ціна: {}\n{}- Рекомендована роздрібна ціна: {} грн\n- Наявність: {}",
    "add_product_second_step_fail": "Ой! Сталася помилка, перевір посилання та спробуй ще раз.",
    "optional_discount_string": "- Оптова ціна зі знижкою: {} грн\n",
    "set_time_first_step": "О котрiй менi краще перевiряти товари?\n\nЗараз це {}",
    "set_time_second_step_fail": "Перевiр формат вводу. Повинно бути два числа з двукрапкою: 19:00, 20:00...\n\nЗапусти команду /time ще раз та введи час у потрiбному форматi",
    "set_time_second_step_success": "Добре, заводжу годинник на {}:{}!\n\nЧекай апдейти по товарам ⭐",
    "remove_product_first_step": "🔗 Вiдправ посилання на продукт, який хочеш видалити",
    "remove_product_second_step_success": "Товар з id {} бiльше не вiдслiдковується 👌",
    "remove_product_second_step_fail": "Я не змiг дiстати iнфу по цьому товару, вибач 😭",
    "info": "👷‍♂️ Звiтую про роботу",
    "info_string": "1. Зараз я слiдкую за {} товарами 🔍\n2. Я надсилаю тобi апдейти у {} ⌚",
    "help": f"⭐ Усі команди бота\n\n/start - Старт\n/add - Додати товар\n/remove - Видалити товар\n/info - Звiт про роботу\n/time - Задати час парсингу",
    "scheduler_start_parsing": "✅ Прийшов час перевiрити товари на сайтi...\n\nЦе займе хвилинку-двi. Я сповiщу по завершенню!",
    "scheduler_parse_string_start": "Характеристики товару {} змінились:\n{}\n\n",
    "scheduler_parse_string_add": "{} товару змінилась.\nРаніше: {}\nЗараз: {}\n\n",
    "scheduler_parse_string_no_changes": "🤙 Я все перевiрив! Товари не змінились",
    "parse_final": "🕵️‍♂️ Я перевiрив всi товари! Бiльше нiяких змiн",
}

# ! переписать на датаклассы